# Напишите программу, которая принимает на вход цифру, обозначающую день недели,
# и проверяет, является ли этот день выходным.

number = int(input('Введите номер дня недели: '))
if (5 < number < 8):
    print('Это выходной.')
elif (0 < number < 6):
    print('Это будни.')
else:
    print('Вы ввели неправильное число.')
