# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).

q = int(input('Введите номер четверти координатной плоскости: '))
if (q == 1):
    print('Диапозон координат: x > 0, y > 0.')
elif (q == 2):
    print('Диапозон координат: x < 0, y > 0.')
elif (q==3):
    print('Диапозон координат: x < 0, y < 0.')
elif (q==4):
    print('Диапозон координат: x > 0, y < 0.')
else:
    print('Введено недопустимое значение.')